{
    "Think of a time when you faced a major decision.": [
      "How did you go about making that decision?",
      "What factors influenced your choice?",
      "Reflect on the outcome. Do you have any regrets or satisfaction with the decision?",
      "How has that decision impacted your life since then?",
      "What did you learn about yourself during the decision-making process?"
    ],
    "Recall a moment when you overcame a significant challenge.": [
      "What strategies or resources did you use to overcome the challenge?",
      "How did overcoming that challenge shape your character?",
      "Were there any unexpected positive outcomes from facing that challenge?",
      "Did the experience change your perspective on future challenges?",
      "How have you applied what you learned from that challenge in other aspects of your life?"
    ],
    "Consider a time when you achieved a personal goal.": [
      "What motivated you to set and pursue that specific goal?",
      "How did you celebrate or acknowledge your achievement?",
      "Did achieving the goal bring you the satisfaction you expected?",
      "Have you set new goals based on the experience of achieving this one?",
      "In what ways has accomplishing that goal influenced your self-esteem?"
    ],
    "Reflect on a moment when you experienced failure.": [
      "How did you cope with the initial disappointment or setback?",
      "What lessons did you extract from the failure?",
      "Did the failure redirect your path or goals in any way?",
      "How did others' reactions or support impact your response to failure?",
      "Have you turned any failures into opportunities for growth?"
    ],
    "Think about a time when you faced a fear.": [
      "How did you muster the courage to confront that fear?",
      "Did facing the fear change your perception of it?",
      "Were there any unexpected positive outcomes from overcoming the fear?",
      "How have you applied the courage gained in other areas of your life?",
      "Have you encountered similar fears since then, and how did you handle them?"
    ],
    "Recall a moment when you had to step out of your comfort zone.": [
      "What made you uncomfortable, and how did you push yourself beyond those boundaries?",
      "Were there any unexpected benefits or growth from stepping out of your comfort zone?",
      "How did you cope with the discomfort during the process?",
      "Has this experience influenced your willingness to take risks in other areas of your life?",
      "In what ways did this experience contribute to your personal development?"
    ],
    "Consider a time when you had to forgive someone.": [
      "What led you to forgive that person, and how did it impact your relationship with them?",
      "Did forgiveness bring you a sense of peace or closure?",
      "How did the act of forgiveness affect your emotional well-being?",
      "Have you applied the concept of forgiveness in other relationships or situations?",
      "What did you learn about yourself through the process of forgiveness?"
    ],
    "Reflect on a moment when you had to let go of something or someone.": [
      "What prompted the decision to let go, and how did you navigate through it?",
      "Did letting go lead to new opportunities or perspectives in your life?",
      "How did you cope with any emotions or attachments during the process?",
      "In what ways has the experience of letting go shaped your priorities?",
      "Have you experienced personal growth as a result of this letting go?"
    ],
    "Think of a time when you felt truly inspired.": [
      "What or who was the source of inspiration, and how did it impact your mindset?",
      "Did this inspiration lead to any positive changes in your life or actions?",
      "How do you sustain and channel inspiration in your daily life?",
      "Has this source of inspiration remained influential over time?",
      "In what ways has inspiration played a role in your personal and professional goals?"
    ],
    "Recall a moment when you had to stand up for your beliefs.": [
      "What values or beliefs were at stake, and why did you choose to defend them?",
      "How did you handle any opposition or challenges during this stand?",
      "Did standing up for your beliefs strengthen your sense of identity?",
      "Have there been any lasting effects on your relationships or personal growth?",
      "In what situations do you feel compelled to assert your beliefs, and how do you approach them?"
    ]
  }
  
